01-Sim/config1b/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

vertices
(
    ( -10 -10 -10 )
    (  10 -10 -10 )
    (  10  10 -10 )
    ( -10  10 -10 )
    ( -10 -10  10 )
    (  10 -10  10 )
    (  10  10  10 )
    ( -10  10  10 )

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    // externalFlow
    // {
    //     type wall;
    //     faces
    //     (
    //         (2 3 7 6)
    //         (0 4 7 3)
    //     );
    // }
    walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (0 1 5 4)
            (2 3 7 6)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
