01-Sim/config1b/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          6400;
        startFace       1546141;
    }
    outlet
    {
        type            patch;
        nFaces          6400;
        startFace       1552541;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25600;
        startFace       1558941;
    }
    config1b_patch20083
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3959;
        startFace       1584541;
    }
)

// ************************************************************************* //
